Repository: tvn24van/ezak
Catalog: assets/translations/l10n_*.arb
Languages: pl

# caption
source: {appName}™️ is an application designed for quick and convenient access to schedules. The name refers to "e-Student PWSZ Nysa" - the recently popular equivalent of eŻak, and to a video clip worth checking out. (Link below)
pl: {appName}™️ to aplikacja stworzona z myślą o szybkim i wygodnym dostępie do planów zajęć. Nazwa nawiązuje do "e-Student PWSZ Nysa" - niedawno popularnego odpowiednika eŻaka oraz do wartego sprawdzenia teledysku. (Link poniżej)

source: Video clip
pl: Teledysk

source: Web app
pl: Aplikacja internetowa

source: Thank you for your contact
pl: Dziękuję za kontakt

# email_feedback_message
source: You will usually wait no longer than a week for a response
pl: Zazwyczaj na odpowiedź czeka się nie dłużej niż tydzień

# choose_courses_date
source: Select a class date
pl: Wybierz datę zajęć

# university_website
source: University's website
pl: Strona uczelni

source: Contact
pl: Kontakt

source: Date selection
pl: Wybór daty

# informations
source: Info
pl: Informacje

source: Theme change
pl: Zmiana motywu

source: Dark theme
pl: Ciemny motyw

source: Language
pl: Język

source: Specialization
pl: Specjalizacja

source: No matches found
pl: Nie znaleziono dopasowań

# error_occurred
source: An error occurred:
pl: Wystąpił błąd:

# no_group_or_specialization
source: There is nothing to show. Make sure you have selected your group, or specialization.
pl: Nie ma nic do wyświetlenia. Upewnij się, że wybrałeś swoją grupę, lub specjalizację.

# group_name
source: {group, select, lecture{Lecture} exercises{Exercises} laboratories{Laboratories} project{Project} seminar{Seminar} other{Other}}
pl: {group, select, lecture{Wykład} exercises{Ćwiczenia} laboratories{Laboratoria} project{Projekt} seminar{Seminarium} other{Inny}}

source: Week
pl: Tydzień

source: even
pl: parzysty

source: odd
pl: nieparzysty

source: Change language if you like
pl: Zmień język, jeśli chcesz

source: Set whether you are a teacher
pl: Ustaw, czy jesteś nauczycielem

source: Choose specialization
pl: Wybierz specjalizację

source: Select lecturer
pl: Wybierz prowadzącego

source: Go to schedule
pl: Przejdź do planu zajęć

source: Show on map
pl: Pokaż na mapie

source: Settings
pl: Ustawienia

source: About app
pl: O aplikacji

# schedule_update_prompt
source: How do you want to update schedule?
pl: W jaki sposób chcesz zaktualizować plan?

source: Force schedule redownload
pl: Wymuś ponowne pobranie planu

# check_for_schedule_update
source: Check schedule for updates
pl: Sprawdź aktualność planu

source: Schedule updating
pl: Aktualizowanie planu

source: Clearing data
pl: Czyszczenie danych

source: Clear data
pl: Wyczyść dane

# clear_data_confirmation
source: Are you sure you want to clear the data?
pl: Czy napewno chcesz wyczyścić dane?

# clear_data_description
source: After a semester you may want to clear caches of schedules you've been viewing
pl: Po upłynięciu semestru możesz wyczyścić pamięć podręczną przeglądanych planów

source: Auto updates
pl: Automatyczne aktualizacje

# auto_updates_subtitle
source: Auto updates works only for students due to limits enforced by REST API
pl: Automatyczne aktualizacje działają tylko dla studentów z powodu limitów narzuconych przez REST API

# online_course
source: Remote classes
pl: Zajęcia zdalne

# full_time_course
source: Full-time classes
pl: Zajęcia stacjonarne

# building_and_room
source: Building {building}, room {room}
pl: Budynek {building}, sala {room}

source: Lecturer
pl: Wykładowca

source: Group
pl: Grupa

source: Longer break
pl: Dłuższa przerwa

source: From {hour}
pl: Od {hour}

source: To {hour}
pl: Do {hour}

# section_of_personalization
source: Personalization
pl: Personalizacja

# section_of_schedule_configuration
source: Schedule configuration
pl: Konfiguracja planu

# section_of_schedule_management
source: Schedule management
pl: Zarządzanie planem

source: User profile
pl: Profil użytkownika

# short_hour
source: h
pl: godz.

source: Rate app
pl: Oceń aplikację

source: Schedule
pl: Plan zajęć

# email_title
source: Help / other case (app version {app_version})
pl: Pomoc / inna sprawa (wersja aplikacji {app_version})

# email_body
source: Change the title according to the subject of the email leaving the application version
pl: Zmień tytuł zgodnie z tematem maila zostawiając wersję aplikacji

source: Source code
pl: Kod źródłowy

# access_to_universitys_email
source: Access to university email
pl: Dostęp do poczty uczelnianej

# open_default_email_app
source: Open email app
pl: Otwórz aplikację pocztową

# email_access_explanation
source: Using android, you can easily access your university email from within your default email app (checked for Gmail). All you need to do is select ‘Add account’ in your Gmail settings, then tap on ‘Exchange and Office 365’ and complete your login details. This method does not require downloading an additional app.
pl: Korzystając z androida możesz uzyskać łatwy dostęp do poczty uczelnianej z poziomu Twojej domyślnej aplikacji pocztowej (sprawdzone dla poczty Gmail). Wystarczy w ustawieniach Gmail-a wybrać opcję "Dodaj konto", następnie dotknąć "Exchange i Office 365" oraz uzupełnić dane logowania. Sposób ten nie wymaga pobierania dodatkowej aplikacji.

source: Useful links
pl: Przydatne linki
